
&НаКлиенте
Процедура ЗавершитьПодбор(Команда)
	
	АдресКорзины = ПоместитьКорзинуВоВременноеХранилище();
	
	ОповеститьОВыборе(АдресКорзины);

КонецПроцедуры

&НаСервере
Функция ПоместитьКорзинуВоВременноеХранилище()
	
	Возврат ПоместитьВоВременноеХранилище(Корзина.Выгрузить());

КонецФункции

&НаКлиенте
Процедура КорзинаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
	Для Каждого Номенклатура Из ПараметрыПеретаскивания.Значение Цикл
		
		ДанныеСтроки = Элементы.Список.ДанныеСтроки(Номенклатура);
		
		ДобавитьВКорзинуИзСписка(ДанныеСтроки)
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("Организация", Параметры.Организация);

КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	ДобавитьВКорзинуИзСписка(ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВКорзинуИзСписка(ДанныеСтрокиСписка)
	
	Если ДанныеСтрокиСписка.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Фильтр = Новый Структура("Номенклатура", ДанныеСтрокиСписка.Ссылка);
	НайденныеСтроки = Корзина.НайтиСтроки(Фильтр);
	
	Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
		Строка = НайденныеСтроки[0];
		Строка.Количество = Строка.Количество + 1;
	Иначе
		Строка = Корзина.Добавить();
		Строка.Номенклатура = ДанныеСтрокиСписка.Ссылка;
		Строка.Количество = 1;
		Строка.Цена = ДанныеСтрокиСписка.Цена;
	КонецЕсли;	
			
	РассчитатьСуммуСтроки(Строка);
	Элементы.Корзина.ТекущаяСтрока = Строка.ПолучитьИдентификатор();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ДанныеСтроки)
	
	ДанныеСтроки.Сумма = ДанныеСтроки.Цена * ДанныеСтроки.Количество;
	
КонецПроцедуры