
&НаСервере
Функция ЗапуститьДлительнуюОперациюСервер()
	
	Результат = Новый Структура("ИдентификаторЗадания, АдресРезультата");
	
	Результат.АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);

	ПараметрыЗадания = Новый Массив;
	ПараметрыЗадания.Добавить(Результат.АдресРезультата);

	ФоновоеЗадание = ФоновыеЗадания.Выполнить("ТяжелыеОперации.ВыполнитьТяжелуюОперацию", ПараметрыЗадания);

	Результат.ИдентификаторЗадания = ФоновоеЗадание.УникальныйИдентификатор;
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура ВыполнитьОперацию(Команда)
	
	ДлительнаяОперация = ЗапуститьДлительнуюОперациюСервер();
	
	ПодключитьОбработчикОжидания("ПроверитьРезультатДлительнойОперации", 2, Истина);
	
	Элементы.СтраницыДлительнойОперации.ТекущаяСтраница = Элементы.СтраницаВыполняется;
	
	Состояние("Операция выполняется", 0);
	
	Обработчик = Новый ОписаниеОповещения("ИзменениеПрогрессаДлительнойОперации", ЭтотОбъект);
	УведомленияКлиента.ПодключитьОбработчик("ВыполнениеТяжелойОперации", Обработчик);
	
	Обработчик = Новый ОписаниеОповещения("ДлительнаяОперацияВыполнена", ЭтотОбъект);
	УведомленияКлиента.ПодключитьОбработчик("ТяжелаяОперацияВыполнена", Обработчик);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьРезультатДлительнойОперации()
	
	СостояниеЗадания = СостояниеЗадания(ДлительнаяОперация);
	
	Если СостояниеЗадания.Состояние = "Ошибка" Тогда
		Элементы.СтраницыДлительнойОперации.ТекущаяСтраница = Элементы.СтраницаОшибкаВыполнения;
		Элементы.ДекорацияТекстОшибки.Заголовок = 
			"Произошла ошибка. Попробуйте повторить или обратитесь к администратору.
			|Техническая информация: " + СостояниеЗадания.ТекстОшибки;
		УведомленияКлиента.ОтключитьОбработчик("ВыполнениеТяжелойОперации");
	КонецЕсли;
	
	Если СостояниеЗадания.Состояние = "Выполняется" Тогда
		ПодключитьОбработчикОжидания("ПроверитьРезультатДлительнойОперации", 2, Истина);
	КонецЕсли;
	
	Если СостояниеЗадания.Состояние = "Выполнено" Тогда
		ОбработатьЗавершениеДлительнойОперации();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗавершениеДлительнойОперации()
	
	Результат = ПолучитьИзВременногоХранилища(ДлительнаяОперация.АдресРезультата);
	Элементы.СтраницыДлительнойОперации.ТекущаяСтраница = Элементы.СтраницаВыполнено;
	Элементы.ДекорацияРезультатУспешногоВыполнения.Заголовок = Результат;
	Оповещение = Новый ОписаниеОповещения("АктивизироватьФорму", ЭтотОбъект);
	ПоказатьОповещениеПользователя("Операция завершена", Оповещение, "Перейти к результату");
	УведомленияКлиента.ОтключитьОбработчик("ВыполнениеТяжелойОперации");
	
КонецПроцедуры

&НаКлиенте
Процедура ДлительнаяОперацияВыполнена(Результат, ДополнительныеПарамеры) Экспорт
	
	ОбработатьЗавершениеДлительнойОперации();
	ОтключитьОбработчикОжидания("ПроверитьРезультатДлительнойОперации");
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеПрогрессаДлительнойОперации(Результат, ДополнительныеПарамеры) Экспорт
	
	ПрогрессОперации = Результат;
	Состояние("Операция выполняется", Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура АктивизироватьФорму(ДополнительныеПараметры) Экспорт
	
	Активизировать();
	
КонецПроцедуры

&НаСервере
Функция СостояниеЗадания(ДлительнаяОперация)
	
	Результат = Новый Структура("Состояние, ТекстОшибки");
	
	ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ДлительнаяОперация.ИдентификаторЗадания);
	
	Если ФоновоеЗадание = Неопределено Тогда
		Результат.Состояние = "Ошибка";
		Результат.ТекстОшибки = "Не найдено исполняющее фоновое задание";
		Возврат Результат;
	КонецЕсли;
	
	Если ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
		Результат.Состояние = "Выполняется";
		Возврат Результат;
	КонецЕсли;
	
	Если ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
		Результат.Состояние = "Ошибка";
		Результат.ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ФоновоеЗадание.ИнформацияОбОшибке);
		Возврат Результат;
	КонецЕсли;
	
	Если ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Отменено Тогда
		Результат.Состояние = "Ошибка";
		Результат.ТекстОшибки = "Задание отменено администратором";
		Возврат Результат;
	КонецЕсли;
	
	Результат.Состояние = "Выполнено";
	Возврат Результат;
	
КонецФункции


