
#Область ПрограммныйИнтерфейс

Процедура ВыполнитьТяжелуюОперацию(АдресРезультата) Экспорт
	
	ОкончаниеОперации = ТекущаяДатаСеанса() + 10;
	
	НомерРодительскогоСеанса = 
		ПолучитьТекущийСеансИнформационнойБазы().ПолучитьФоновоеЗадание().НомерРодительскогоСеанса;
	
	ПолучателиУведомлений = Новый Массив;
	ПолучателиУведомлений.Добавить(НомерРодительскогоСеанса);
	
	Прогресс = 0;
	
	Пока ТекущаяДатаСеанса() < ОкончаниеОперации Цикл
		ТекущийПрогресс = 100 - (ОкончаниеОперации - ТекущаяДатаСеанса()) * 10;
		Если Прогресс <> ТекущийПрогресс Тогда
			Прогресс = ТекущийПрогресс;
			УведомленияКлиента.ОтправитьУведомление("ВыполнениеТяжелойОперации", Прогресс, ПолучателиУведомлений);
		КонецЕсли;
		А = 1;
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище("Завершено", АдресРезультата);
	
	УведомленияКлиента.ОтправитьУведомление("ТяжелаяОперацияВыполнена", АдресРезультата, ПолучателиУведомлений);
	
КонецПроцедуры

#КонецОбласти
