
#Область ПрограммныйИнтерфейс

// Цена номенклатуры.
// 
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура
//  Организация - СправочникСсылка.Организации
//  Период - Дата, Неопределено - Период
// 
// Возвращаемое значение:
//  Число - Цена номенклатуры в установленную дату по прайсу организации
//
Функция ЦенаНоменклатуры(Номенклатура, Организация, Период = Неопределено) Экспорт
	
	Возврат ЦеныНоменклатуры.ЦенаНоменклатуры(Номенклатура, Организация, Период);
	
КонецФункции

#КонецОбласти

